# The Creation of Spatio-Temporal (Daily) Observer Intensity

## SQL

In [1]:
import pandas as pd

%load_ext sql

Establish a connection to the data base before you run the following cell:
Create a text file called **.env** containing

> PGSQL_USER=USERNAME  \
> PGSQL_PASSWORD= PASSWORD 

**Note:** I (Cannur) created .env file with my credentials so you do not need to create it. You can run it directly.

In [2]:
from dotenv import load_dotenv
import os

load_dotenv()
username = os.getenv('PGSQL_USER')
password = os.getenv('PGSQL_PASSWORD')
hostname = 'gip.itc.utwente.nl'
portname = '5434'
databasename = 'c211'

%sql postgresql://{username}:{password}@{hostname}:{portname}/{databasename}

Now, we can find the database has how many rows.

In [3]:
%sql \
select count(*) as Row_Counts\
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(2530161,)]

Now, we can see the 3 rows from our table.

In [4]:
%%sql 
Select * from vw_observation2017
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(2162176, '534', '31661', datetime.date(2017, 2, 1), 28263, 190, 552, '16:00', 36605311),
 (2217594, '484', '31661', datetime.date(2017, 5, 11), 27487, 187, 547, '15:20', 36605312),
 (2228156, '614', '31661', datetime.date(2017, 5, 24), 27234, 186, 551, '14:00', 36605313)]

We can check the null cells.

In [5]:
%%sql 
select count(*) 
from vw_observation2017 
where id isnull or 
 species isnull or 
 observer isnull or
 obsdate isnull or 
 block isnull or 
 longit isnull or
 latit isnull or
 obstime isnull or
 idd isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

We can check the just obstime column to see null cells. And all null cells in the table from obstime. In this case, we will not use the obstime as a variable for the observer intensity, so we do not want to delete this null value to not loss the observation data.

In [6]:
%%sql 
select count(*) 
from vw_observation2017 
where obstime isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

In [7]:
%%sql 
select *
from vw_observation2017 
where obstime isnull
Limit 5

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
5 rows affected.

[(3689241, '9', '27328', datetime.date(2017, 6, 8), 6087, 91, 464, None, 36606237),
 (3697762, '9', '27328', datetime.date(2017, 6, 18), 5973, 90, 472, None, 36606410),
 (3689260, '165', '27328', datetime.date(2017, 6, 29), 6087, 91, 464, None, 36606766),
 (3689116, '9', '27328', datetime.date(2017, 3, 9), 6087, 91, 464, None, 36606858),
 (2776302, '614', '34326', datetime.date(2017, 5, 7), 16152, 142, 453, None, 36640538)]

We can see the 3 rows for the other tables.

In [8]:
%%sql 
Select * from vw_myblocklanduse
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(60, 'Hoofdweg', 1, 6537.33085031952),
 (60, 'Landbouw', 1, 871977.654549437),
 (60, 'Recreatie', 1, 39618.6174416008)]

In [9]:
%%sql 
Select * from precipitation
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(56527, 20170109, 52.2948, 4.98448, 6.73831, '010100002040710000ED0FD0C36322FF40A895D9D24D361D41', 12802),
 (56527, 20170110, 52.2948, 4.98448, 0.691688, '010100002040710000ED0FD0C36322FF40A895D9D24D361D41', 12802),
 (56527, 20170111, 52.2948, 4.98448, 0.0, '010100002040710000ED0FD0C36322FF40A895D9D24D361D41', 12802)]

In [10]:
%%sql 
Select * from temperature
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(8884, 20170605, 50.8654, 5.80671, 23.4842, '0101000020407100008F49F957B58606413CD63063A5811341', 43581),
 (8884, 20170606, 50.8654, 5.80671, 17.7815, '0101000020407100008F49F957B58606413CD63063A5811341', 43581),
 (8884, 20170607, 50.8654, 5.80671, 18.6321, '0101000020407100008F49F957B58606413CD63063A5811341', 43581)]

In [11]:
%%sql 
Select * from block_demography
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(167, 18, 375, '0103000020407100000100000005000000000000000094D1400000000060E31641000000000094D1400000000000F3164100000000008ED2400000000000F3164100000000008ED2400000000060E31641000000000094D1400000000060E31641', 5, 115, 1005, 1755, 4275, 8715, 9390, 9565),
 (168, 18, 376, '0103000020407100000100000005000000000000000094D1400000000000F31641000000000094D14000000000A002174100000000008ED24000000000A002174100000000008ED2400000000000F31641000000000094D1400000000000F31641', 10, 450, 1070, 1725, 3885, 6915, 9220, 9525),
 (169, 18, 377, '0103000020407100000100000005000000000000000094D14000000000A0021741000000000094D140000000004012174100000000008ED240000000004012174100000000008ED24000000000A0021741000000000094D14000000000A0021741', 0, 475, 625, 1660, 1885, 6515, 7420, 9345)]

In [12]:
%%sql 
Select * from block_road_access
Limit 5

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
5 rows affected.

[(60, 'W', 1, 900.48733374501),
 (61, 'W', 1, 1656.38376965095),
 (62, 'G', 1, 656.363163271632),
 (62, 'P', 1, 1187.96007576262),
 (62, 'W', 1, 3335.78142596005)]

In [13]:
%%sql 
Select * from days
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(20170102, datetime.date(2017, 1, 2), 2, 1, False),
 (20170103, datetime.date(2017, 1, 3), 3, 2, False),
 (20170104, datetime.date(2017, 1, 4), 4, 3, False)]

We can find: 
- how many observer, 
- different species and 
- different blocks.

In [14]:
%%sql 
Select count(distinct observer) as Number_of_Observer
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(11805,)]

In [15]:
%%sql 
Select count(distinct species) as Number_of_Species
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(464,)]

In [16]:
%%sql 
Select count(distinct block) as Number_of_block
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(33535,)]

### New Tables

We can directly use some tables (precipitation, temperature and block_demography). But for others, we should create new tables for observer intensity, days, road length and landuse.

#### 1. Observer intensity

Now we create new table for observer intensity from *vw_observation2017*. The observer intensity is calculated as observer count in per block and per day.

In [17]:
%%sql 
CREATE TABLE observer_intensity 
AS SELECT obsdate, block, COUNT(DISTINCT observer) observer_intensity 
FROM vw_observation2017 
GROUP BY block, obsdate

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
538524 rows affected.

[]

#### 2. Days

Now we create new table to define months, work days and holidays from *days*.

In [18]:
%%sql 
CREATE Table days_new
AS SELECT *
FROM days

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
181 rows affected.

[]

We add month column *dom*.

In [19]:
%%sql 
ALTER TABLE days_new
add dom varchar(10)

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

Set the *dom* column according to 6 months.

In [20]:
%%sql 
UPDATE days_new
set dom = 'January'
Where mdate between '20170101' and '20170131'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
31 rows affected.

[]

In [21]:
%%sql 
UPDATE days_new
set dom = 'February'
Where mdate between '20170201' and '20170231'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
28 rows affected.

[]

In [22]:
%%sql 
UPDATE days_new
set dom = 'March'
Where mdate between '20170301' and '20170331'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
31 rows affected.

[]

In [23]:
%%sql 
UPDATE days_new
set dom = 'April'
Where mdate between '20170401' and '20170431'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
30 rows affected.

[]

In [24]:
%%sql 
UPDATE days_new
set dom = 'May'
Where mdate between '20170501' and '20170531'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
31 rows affected.

[]

In [25]:
%%sql 
UPDATE days_new
set dom = 'June'
Where mdate between '20170601' and '20170631'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
30 rows affected.

[]

Add *holiday* column.

In [26]:
%%sql 
ALTER TABLE days_new
add holiday int

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

Set the *holiday* column.

In [27]:
%%sql 
UPDATE days_new
set holiday = 1
where dow = 0 or dow = 6

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
51 rows affected.

[]

In [28]:
%%sql 
UPDATE days_new
set holiday = 1
where natholiday = 'true'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
9 rows affected.

[]

In [29]:
%%sql 
UPDATE days_new
set holiday = 0
where holiday isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
124 rows affected.

[]

Add *work_day* column.

In [30]:
%%sql 
ALTER TABLE days_new
add work_day int

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

Set the *work_day* column.

In [31]:
%%sql 
UPDATE days_new
set work_day = 1
where holiday = 0

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
124 rows affected.

[]

In [32]:
%%sql 
UPDATE days_new
set work_day = 0
where holiday = 1

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
57 rows affected.

[]

#### 3. Road Length

Now we create new table for roadlength from *block_road_access*. Because we want to set different maintainer as different variables. The new roadlength table name is **"roadlength_new"**.

In [33]:
%%sql 
CREATE Table roadlength
AS SELECT block, maintainer, roadlength
FROM block_road_access

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
49184 rows affected.

[]

Set the maintainers type as columns.

In [34]:
%%sql 
ALTER TABLE roadlength 
ADD municipality double precision, 
ADD province double precision, 
ADD water_authority double precision, 
ADD rijk double precision, 
ADD other_maintainers double precision

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

In [35]:
%%sql 
UPDATE roadlength
set municipality = roadlength 
where maintainer = 'G'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
31909 rows affected.

[]

In [36]:
%%sql 
UPDATE roadlength
set municipality = 0 
where municipality isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
17275 rows affected.

[]

In [37]:
%%sql 
UPDATE roadlength
set province = roadlength 
where maintainer = 'P'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
8104 rows affected.

[]

In [38]:
%%sql 
UPDATE roadlength
set province = 0 
where province isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
41080 rows affected.

[]

In [39]:
%%sql 
UPDATE roadlength
set water_authority = roadlength 
where maintainer = 'W'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
4232 rows affected.

[]

In [40]:
%%sql 
UPDATE roadlength
set water_authority = 0 
where water_authority isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
44952 rows affected.

[]

In [41]:
%%sql 
UPDATE roadlength
set rijk = roadlength 
where maintainer = 'R'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3852 rows affected.

[]

In [42]:
%%sql 
UPDATE roadlength
set rijk = 0 
where rijk isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
45332 rows affected.

[]

In [43]:
%%sql 
UPDATE roadlength
set other_maintainers = roadlength 
where maintainer = 'T'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1087 rows affected.

[]

In [44]:
%%sql 
UPDATE roadlength
set other_maintainers = 0 
where other_maintainers isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
48097 rows affected.

[]

Now we merge rows for the same block.

In [45]:
%%sql 
Create Table roadlength_new AS
SELECT block, max(municipality) municipality, max(province) province, 
max(water_authority) water_authority, max(rijk) rijk, max(other_maintainers) other_maintainers
From roadlength
Group by block

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
34314 rows affected.

[]

#### 4. Landuse

Now we create new table for landuse from *vw_myblocklanduse*. Because we want to set different landuse types as different variables. The new landuse table name is **"landuse_new"**.

In [46]:
%%sql 
CREATE Table landuse
AS SELECT block, category, areasum
FROM vw_myblocklanduse

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
191883 rows affected.

[]

Set the landuse type as columns.

In [47]:
%%sql 
ALTER TABLE landuse 
ADD nature_reserves double precision, 
ADD built_up double precision, 
ADD dry_natural_terrain double precision, 
ADD greenhouse_horticulture double precision, 
ADD railway double precision,
ADD company_site double precision, 
ADD wet_natural_terrain double precision, 
ADD airport double precision, 
ADD forest double precision, 
ADD coastal_water double precision,
ADD semi_built double precision,
ADD agriculture double precision,
ADD recreation double precision, 
ADD water double precision, 
ADD highway double precision

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]

In [48]:
%%sql 
UPDATE landuse
set nature_reserves = areasum 
where category = 'nature reserves'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
13707 rows affected.

[]

In [49]:
%%sql 
UPDATE landuse
set nature_reserves = 0 
where nature_reserves isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
178176 rows affected.

[]

In [50]:
%%sql 
UPDATE landuse
set built_up = areasum 
where category = 'Bebouwd'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
13954 rows affected.

[]

In [51]:
%%sql 
UPDATE landuse
set built_up = 0 
where built_up isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
177929 rows affected.

[]

In [52]:
%%sql 
UPDATE landuse
set dry_natural_terrain = areasum 
where category = 'Droog natuurlijk terrein'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
5282 rows affected.

[]

In [53]:
%%sql 
UPDATE landuse
set dry_natural_terrain = 0 
where dry_natural_terrain isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
186601 rows affected.

[]

In [54]:
%%sql 
UPDATE landuse
set greenhouse_horticulture = areasum 
where category = 'Glastuinbouw'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1851 rows affected.

[]

In [55]:
%%sql 
UPDATE landuse
set greenhouse_horticulture = 0 
where greenhouse_horticulture isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
190032 rows affected.

[]

In [56]:
%%sql 
UPDATE landuse
set railway = areasum 
where category = 'Spoorweg'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3819 rows affected.

[]

In [57]:
%%sql 
UPDATE landuse
set railway = 0 
where railway isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
188064 rows affected.

[]

In [58]:
%%sql 
UPDATE landuse
set company_site = areasum 
where category = 'Bedrijfsterrein'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
9269 rows affected.

[]

In [59]:
%%sql 
UPDATE landuse
set company_site = 0 
where company_site isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
182614 rows affected.

[]

In [60]:
%%sql 
UPDATE landuse
set wet_natural_terrain = areasum 
where category = 'Nat natuurlijk terrein'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
5978 rows affected.

[]

In [61]:
%%sql 
UPDATE landuse
set wet_natural_terrain = 0 
where wet_natural_terrain isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
185905 rows affected.

[]

In [62]:
%%sql 
UPDATE landuse
set airport = areasum 
where category = 'Vliegveld'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
221 rows affected.

[]

In [63]:
%%sql 
UPDATE landuse
set airport = 0 
where airport isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
191662 rows affected.

[]

In [64]:
%%sql 
UPDATE landuse
set forest = areasum 
where category = 'Bos'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
18791 rows affected.

[]

In [65]:
%%sql 
UPDATE landuse
set forest = 0 
where forest isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
173092 rows affected.

[]

In [66]:
%%sql 
UPDATE landuse
set coastal_water = areasum 
where category = 'Coastal water'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
4561 rows affected.

[]

In [67]:
%%sql 
UPDATE landuse
set coastal_water = 0 
where coastal_water isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
187322 rows affected.

[]

In [68]:
%%sql 
UPDATE landuse
set semi_built = areasum 
where category = 'Semi-bebouwd'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
11343 rows affected.

[]

In [69]:
%%sql 
UPDATE landuse
set semi_built = 0 
where semi_built isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
180540 rows affected.

[]

In [70]:
%%sql 
UPDATE landuse
set agriculture = areasum 
where category = 'Landbouw'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
32867 rows affected.

[]

In [71]:
%%sql 
UPDATE landuse
set agriculture = 0 
where agriculture isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
159016 rows affected.

[]

In [72]:
%%sql 
UPDATE landuse
set recreation = areasum 
where category = 'Recreatie'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
13807 rows affected.

[]

In [73]:
%%sql 
UPDATE landuse
set recreation = 0 
where recreation isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
178076 rows affected.

[]

In [74]:
%%sql 
UPDATE landuse
set water = areasum 
where category = 'Water'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
23019 rows affected.

[]

In [75]:
%%sql 
UPDATE landuse
set water = 0 
where water isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
168864 rows affected.

[]

In [76]:
%%sql 
UPDATE landuse
set highway = areasum 
where category = 'Hoofdweg'

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
33414 rows affected.

[]

In [77]:
%%sql 
UPDATE landuse
set highway = 0 
where highway isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
158469 rows affected.

[]

Now we merge rows for the same block.

In [78]:
%%sql 
Create Table landuse_new AS
SELECT block, max(built_up) built_up, max(dry_natural_terrain) dry_natural_terrain, 
max(greenhouse_horticulture) greenhouse_horticulture, max(railway) railway, max(nature_reserves) nature_reserves, 
max(company_site) company_site, max(wet_natural_terrain) wet_natural_terrain, 
max(airport) airport, max(forest) forest, max(coastal_water) coastal_water, 
max(semi_built) semi_built, max(agriculture) agriculture, 
max(recreation) recreation, max(water) water, max(highway) highway
From landuse
Group by block

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
41590 rows affected.

[]

### MERGE TABLE

Our primary table is *observer_intensity*. Now, we can merge it with *days* table. And then we can get the day of week, day of weekend and national holiday data. In this case, we use the ***Inner Join*** function because, we do not want to create null cells.

In [79]:
%%sql 
CREATE TABLE merged_1 AS SELECT observer_intensity.*, days_new.mdate, days_new.holiday, days_new.work_day
FROM observer_intensity INNER JOIN days_new ON observer_intensity.obsdate = days_new.odate

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
538524 rows affected.

[]

We can merge the other related tables with *merged_1*. We added precipitation, temperature, population and roadlength and landuse data.

In [80]:
%%sql 
CREATE TABLE merged_2 AS 
SELECT merged_1.*, 
precipitation.precip, 
temperature.temper, 
block_demography.pop001, block_demography.pop009, block_demography.pop025, block_demography.pop049, block_demography.pop081, block_demography.pop121, block_demography.pop169, block_demography.pop225,
roadlength_new.municipality, roadlength_new.province, roadlength_new.water_authority, roadlength_new.rijk, roadlength_new.other_maintainers,
landuse_new.built_up, landuse_new.dry_natural_terrain, landuse_new.greenhouse_horticulture, landuse_new.railway, landuse_new.nature_reserves, landuse_new.company_site, landuse_new.wet_natural_terrain, landuse_new.airport, landuse_new.forest, landuse_new.coastal_water, landuse_new.semi_built, landuse_new.agriculture, landuse_new.recreation, landuse_new.water, landuse_new.highway      
FROM merged_1 
INNER JOIN precipitation ON merged_1.mdate = precipitation.dtime and merged_1.block = precipitation.block 
INNER JOIN temperature ON merged_1.mdate = temperature.dtime and merged_1.block = temperature.block 
INNER JOIN block_demography ON merged_1.block = block_demography.block
INNER JOIN roadlength_new ON merged_1.block = roadlength_new.block
INNER JOIN landuse_new ON merged_1.block = landuse_new.block

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
515248 rows affected.

[]

Now we can see what we did until here. We can see our merged table with only 3 rows.

In [81]:
%%sql 
Select * from merged_2
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(datetime.date(2017, 2, 5), 60, 1, 20170205, 1, 0, 0.235353, 7.46328, 10, 50, 125, 2400, 4060, 4560, 4725, 7490, 0.0, 0.0, 900.48733374501, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 871977.654549437, 39618.6174416008, 59546.2776526384, 6537.33085031952),
 (datetime.date(2017, 3, 13), 61, 1, 20170313, 0, 1, 0.0, 11.5924, 0, 55, 1895, 2645, 4085, 4610, 5175, 7645, 0.0, 0.0, 1656.38376965095, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 974196.820423422, 0.0, 4213.06842461356, 9465.25592069767),
 (datetime.date(2017, 6, 8), 61, 1, 20170608, 0, 1, 4.09303, 23.4118, 0, 55, 1895, 2645, 4085, 4610, 5175, 7645, 0.0, 0.0, 1656.38376965095, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 974196.820423422, 0.0, 4213.06842461356, 9465.25592069767)]

In [82]:
%%sql 
Alter Table merged_2
Drop Column obsdate, 
Drop Column block,
Drop Column mdate

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
Done.

[]